{"review_id": "eiy8iFTNt3znxi7c6BCbOg", "user_id": "jwwey_SIMFgDIAuqnSdFzw", "business_id": "7bKg_T6yIFWnJE_OTOK8Eg", "stars": 1, "date": "2016-10-04", "text": "I am no skinny guy and eat a lot of take out. \nNot proud of that, but I do want any reader of this to understand and trust a person that eats at or from locations more than once. \nI ordered a pizza via the dominoes smart phone App, which is fantastic and I have done it a few times before. \nThe last time, the delivery took 1 hour and that is not the issue. \nThe issue is that the pizza was horrible. Cold and just bad. \nIt was barely eatable. \nShamefully. \nI did eat it, because I was hungry and I didn't want to leave the delivery person hanging, because I know he was just doing his best.\nI am a working person like all and he was not to blame for the way this specific franchise has been run since it opened at this specific location. \nSo I still paid and tipped that driver 20 percent and took the cold pizza and again sadly admit I heated it up and ate it. \nNot dominoes fault I chose to still eat it, but I was being too nice. \nI figure life is too short to sweat a couple of pizza. \nI am busy working from home and timed it to deliver for convenience. \nToday I used the App again. \n\nThis is by far, the worst customer experience I have ever had. \nSorry but not paying a company to be mean to me and deliver disgustingly cold food. \nThe Order was placed  at 3:03 pm. I have the email confirmation because of the App. \nThe dominoes App is fantastic. \nSomehow the actual service is horrid. \nI thought the last time was a one off. \nEvery company can deliver bad service once right? \nBut now 1 hour and 1 minute later no delivery. \nI call the number within the App to reach the franchise. \nI receive an employee on the phone who gets mad at me because I did not want to wait for the pizza. \nAlso that I was lying and he was too busy helping customers. \nInteresting as I do not know what category I fall under. \nHe started to say I ordered it 30 minutes ago not an hour. \nThen he accused me, a repeat and loyal customer of his exact location, that I was just thinking tying to get a free meal out of it. \nOh now I know the category. \nI am not a customer but a thief. \nMeanwhile the driver arrives and I am standing in my driveway of my home. \nI ask the driver how long did it take to get to me. \nHe replies it took just over 20 minutes from the time he left the dominoes location. \nHe admitted politely he got stuck in traffic. \nThe person on the phone then replied that the driver was lying and he only left 10 minutes ago. \nI say to the driver politely; \nLook sorry, I ate it last time, but I do not want it this time cold. \nSorry. \nBut I don't want to pay for a cold meal again. \nAll the while, the employee on the phone is yelling at me on the phone. \nWell don't @@\"\"\" take the food then. \nI said aloud please don't speak to me that way and what is your name? And don't worry keep the cold food and I will not order again. \nI then called the glorified amazing customer service as it is represented on the internet and they care so very much. \nI had to leave a voicemail and wait 20 minutes for a call back. \nWhen I did reprieve one in that timespan, the lady told me she was doing her best to help me, because she was supposed to be in the office but was sick at home and called me back from her home. \nWhat? \nWhat kind of nation wide pizza chain is this? \nShe then made it sound like I was being very demanding. \nSo I hung up and ordered from Pizza Nova. \nGo figure it was the same price for much much much I stress better hot pizza and wings for me and a friend to enjoy after work and just s the pregame coverage begins for the jay playoff wildcard game at 7. \nAnd yes, I am so upset with how I was treated I had to hop on my smart phone and type this as I awaited the pizza nova delivery. \nSorry for any typos. \nNow going to enjoy a real pizza and wings with friends. \nIf you like dominoes that is fine, but this location is a complete horrid place to expect any decent service from or any actual hot food. \nGo figure. An entire pizza chain, a customer service executive calling me back from home because she was too sick too go into work. Again bizarre system. And still no one could provide any pizza. \nA whole pizza chain and no pizza delivery. \nHorrible food but even worst by far, was the service and the higher up I complained, the more annoyed dominoes seemed to be telling me well they cannot control franchises. \nSo in conclusion, great smart phone app Dominoes now maybe you can actually deliver the good and I don't know not yell at your customers. \nFinally, pizza nova is better. I was trying to save money as dominoes is cheaper but the agent on the phone at Pizza nova combined a lot of coupons that provide me the same price. \nWhy you ask? \nBecause he was sad to hear about why I was calling pizza nova in the first place. \nThat's right. \nPizza nova fixed my horrible experience that dominoes created! \nI do not have any affiliation with pizza nova. \nI work in an entirely different field than the food industry. \nI just wanted to explain the whole experience. \nThank you.", "useful": 1, "funny": 2, "cool": 0, "categories": ["Chicken Wings", "Restaurants", "Pizza", "Event Planning & Services", "Sandwiches", "Caterers"]}