{"review_id": "fVbyf2_-fjOO0gpe0yrb9w", "user_id": "HeHsBwy9vv8-Rc_VzRTbPg", "business_id": "Tax_5L_C559yBm5Tc3mDZQ", "stars": 2, "date": "2007-09-06", "text": "Sweet \"O\" is more like Sweet \"NO\". \n\nWas intruiged by their website and good reviews, went on a wednesday afternoon around 430. We were the ONLY table. We ordered a two drinks, two sandwiches, and one dessert to share. The drinks were good, and the food had a lot of potential (although one sandwich was better than the other...) until I found a pretty gross hair embedded in the middle of my sandwich, mid-bite. Now, anyone who's worked food service can respect the occasional mistake. Sure, you cant control when your hair falls out. But what is getting the bad review from me is how BADLY the staff handled it. \n\nUpon notifying the waitress, she unapologetically stated \"Well I have no idea how that could have possibly gotten in there\"... Almost as if I placed it there. It was short, black, and still had skin connected to it. I don't have short black hair. So she took it away. She then asked if I would like something else, to which I asked if it were possible to make another half sandwich. She came out with a completely different sandwich than I ordered (which of course was the one I didn't care for). So I gave up on trying to get any more dinner and we focused on dessert. It was decent, but nothing I couldn'tve gotten at applebee's on happy hour. \n\nThen came the bill. Not a single thing had been comped, and it reached $60 dollars. When my friend complained, the waitress hastily said \"I'll get the manager\". Manager comes bustling out, sets a new bill on the table, and walks off. \n\nI understand mistakes in food. I truely do. But the way this staff handled a mistake that was completely their own was ridiculous. Never ONCE in the evening did we get an \"I'm sorry\" from any staff member.\n\nI won't be going back there again. And by the attitues they exhibited, It didn't appear as if they cared that I told anyone else not to go there either.\n\n2/19/08 EDIT: The owner has contacted me, apologized, and shared that there is new management. Might be worth another try.", "useful": 5, "funny": 2, "cool": 0, "categories": ["Food", "Desserts", "Restaurants", "Italian"]}