{"review_id": "dJLNUmY51FNOT5WKM6Sz-Q", "user_id": "HeHsBwy9vv8-Rc_VzRTbPg", "business_id": "W72t6xTko3RBwRHP2mNXig", "stars": 1, "date": "2008-05-03", "text": "Okay I know that this place is closed, so writing a review is pretty much moot..... but what the hell, I'm in a sharing mood.\n\nDear.Sweet.LORD. \n\nTHE WORST\n\nI MEAN ****WORST**** restaurant experience I have ever had. EVER.\n\nIt's been closed for quite some time now, and my memory is failing as to exactly every detail...but let's see what I can come up with..\n\nParty of 4, we walked in and there was no hostess. Other patrons milling about, also waiting. Some woman with a baby bottle kept walking up front and grabbing stuff, leaving w/o talking to us. Finally she said \"someone\" would be with us shortly. \n\nWe're seated. Throughout the HOURS that we sat there, we were consistently (more than once) give the wrong dishes, no water, no chips, and no refills on drinks. It took an act of CONGRESS to track anyone down. Finally, mid-horrific-evening, we flat-out asked someone \"Do we even HAVE a server?!\" because everyone who walked by either ignored us or said they'd take care of something but never did. Their answer? No! They ACTUALLY said no! \n\nGreat. So hours pass, and the man is getting heated by now, not to mention the people who suggested it (other half of our party) are embarassed. \n\nOwner/manager seems to be the only one trying to help the ENTIRE restaurant - but he's still doing a poor job. He makes excuses about \"5 of his waitstaff\" calling off that night. Uh huh. \n\nby the way - the food that we DID get was decent.\n\nAnyway, more time passes and we notice other tables getting up to ROAM the place for the manager, a server, anyone! So our friend gets up and does the same thing. He reams the manager about our experience, what we were charged for and never recieved, so on and so forth..... Manger gives us a 50% off bill. \n\nWe shouldn't have even paid that. The entire thing should have been comped. Honestly, I don't look for freebees, but this was the most outrageous experience I have ever seen. We left zero tip.\n\nFelt a little sorry for them, but like Kevin H. said, it is not surprising that they went down, and quickly.", "useful": 2, "funny": 3, "cool": 1, "categories": ["Mexican", "Restaurants"]}